Repository: Chudson16/docs
Catalog: source/locale/*/LC_MESSAGES/faq.po
Languages: cs

source: Frequently Asked Questions
cs: Často kladené otázky

source: Data Processing
cs: Zpracování dat

source: Can I process two or more orthophoto GeoTIFFs to stitch them together?
cs: Mohu zpracovat dva nebo více ortofotografických souborů GeoTIFF a spojit je dohromady?

source: No. ODM is a photogrammetric pipeline and orthophotos do not have the necessary camera information since the images have already been orthorectified. You can use another program such as `Hugin <http://hugin.sourceforge.net/>`_ to do that.
cs: Ne. ODM je fotogrammetrický postup a ortofotomapy neobsahují potřebné informace o fotoaparátu, protože snímky již byly ortorektifikovány. K tomu můžete použít jiný program, například `Hugin <http://hugin.sourceforge.net/>`_.

source: Licensing
cs: Licencování

source: I want to build a commercial application that includes ODM. Do I need a commercial license?
cs: Chci vytvořit komerční aplikaci, která zahrnuje ODM. Potřebuji komerční licenci?

source: ODM is free and open source software, released under the `AGPLv3 <https://github.com/OpenDroneMap/ODM/blob/master/LICENSE>`_. You are free to build and sell applications with it, just make sure to comply with the requirements of the license, in particular the disclose source requirement.
cs: ODM je svobodný software s otevřeným zdrojovým kódem vydaný pod licencí `AGPLv3 <https://github.com/OpenDroneMap/ODM/blob/master/LICENSE>`_. Můžete s ním svobodně vytvářet a prodávat aplikace, jen se ujistěte, že splňujete požadavky licence, zejména požadavek na zveřejnění zdrojového kódu.

source: Are there other licensing options aside from the AGPLv3?
cs: Existují kromě licence AGPLv3 i jiné možnosti licencování?

source: Nope, sorry!
cs: Ne, litujeme!

source: `Learn to edit <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ and help improve `this page <https://github.com/OpenDroneMap/docs/blob/publish/source/faq.rst>`_!
cs: `Naučte se upravovat <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ a pomozte zlepšit `tuto stránku <https://github.com/OpenDroneMap/docs/blob/publish/source/faq.rst>`_!
