Repository: Chudson16/docs
Catalog: source/locale/*/LC_MESSAGES/installation.po
Languages: cs, id

source: Installation and Getting Started
cs: Instalace a spuštění
id: Cara memulai dan instalasi

source: This section is excerpted and modified with permission from `OpenDroneMap: The Missing Guide <https://odmbook.com>`_, by Piero Toffanin.
cs: Tato část je převzata a upravena se svolením z `OpenDroneMap: The Missing Guide <https://odmbook.com>`_, autor Piero Toffanin.
id: Bagian ini dikutip dan dimodifikasi dengan izin dari `OpenDroneMap: Panduan yang Hilang <https://odmbook.com>`_, oleh Piero Toffanin.

source: Hardware Recommendations
cs: Doporučení k hardwaru
id: Rekomendasi Perangkat Keras

source: The bare minimum requirements for running the software are:
cs: Minimální požadavky pro spuštění softwaru jsou:
id: Persyaratan minimal untuk menjalankan perangkat lunak adalah:

source: 64bit CPU manufactured on or after 2010
cs: 64bitový procesor vyrobený v roce 2010 nebo později
id: CPU 64bit diproduksi pada atau setelah 2010

source: 20 GB of disk space
cs: 20 GB místa na disku
id: Media penyimpanan 20 GB

source: No more than 100-200 images can be processed with the above specifications (the software will run out of memory). Recommended requirements are:
cs: S výše uvedenými specifikacemi lze zpracovat maximálně 100-200 snímků (software vyčerpá paměť). Doporučené požadavky jsou:
id: Tidak lebih dari 100-200 gambar yang dapat diproses dengan spesifikasi di atas (software akan kehabisan memori). Persyaratan yang direkomendasikan adalah:

source: Latest Generation CPU
cs: Nejnovější generace CPU
id: CPU Generasi Terakhir

source: 100 GB of disk space
cs: 100 GB místa na disku
id: Media penyimpanan 100 GB

source: The above will allow for a few hundred images to be processed without too many issues. A CPU with more cores will allow for faster processing, while a graphics card (GPU) currently has no impact on performance. For processing more images, add more disk space and RAM linearly to the number of images you need to process.
cs: Výše uvedený postup umožní zpracovat několik stovek snímků bez větších problémů. Procesor s více jádry umožní rychlejší zpracování, zatímco grafická karta (GPU) nemá v současné době na výkon žádný vliv. Pro zpracování většího počtu snímků přidejte více místa na disku a paměti RAM lineárně podle počtu snímků, které potřebujete zpracovat.
id: Di atas akan memungkinkan beberapa ratus gambar untuk diproses tanpa terlalu banyak masalah. CPU dengan lebih banyak core akan memungkinkan pemrosesan lebih cepat, sementara kartu grafis (GPU) saat ini tidak berdampak pada kinerja. Untuk memproses lebih banyak gambar, tambahkan lebih banyak ruang disk dan RAM secara linier ke jumlah gambar yang perlu anda proses.

source: Installation
cs: Instalace
id: Instalasi

source: We recommend people use `docker <https://www.docker.com>`_ for running ODM, whether you are on Windows, macOS or Linux.
cs: Pro spuštění ODM doporučujeme používat `docker <https://www.docker.com>`_, ať už používáte Windows, MacOS nebo Linux.
id: Kami menyarankan orang-orang menggunakan `docker <https://www.docker.com>` _ untuk menjalankan ODM, baik anda menggunakan Windows, macOS atau Linux.

source: To run OpenDroneMap you need at least Windows 7. Previous versions of Windows are not supported.
cs: Pro spuštění OpenDroneMap potřebujete alespoň Windows 7. Předchozí verze systému Windows nejsou podporovány.
id: Untuk menjalankan OpenDroneMap Anda membutuhkan setidaknya Windows 7. Versi Windows sebelumnya tidak didukung.

source: Step 1. Check Virtualization Support
cs: Krok 1. Zkontrolujte podporu virtualizace
id: Langkah 1. Periksa Dukungan Virtualisasi

source: Docker requires a feature from your CPU called virtualization, which allows it to run virtual machines (VMs). Make sure you have it enabled! Sometimes this is disabled. To check, on Windows 8 or higher you can open the **Task Manager** (press CTRL+SHIFT+ESC) and switch to the **Performance** tab.
cs: Docker vyžaduje od procesoru funkci zvanou virtualizace, která mu umožňuje spouštět virtuální počítače (VM). Ujistěte se, že ji máte povolenou! Někdy je tato funkce vypnutá. Chcete-li to zkontrolovat, můžete v systému Windows 8 nebo vyšším otevřít **Správce úloh** (stiskněte klávesy CTRL+SHIFT+ESC) a přepnout na kartu **Výkon**.
id: Docker memerlukan fitur dari CPU anda yang disebut virtualisasi, yang memungkinkannya menjalankan mesin virtual (VM). Pastikan anda telah mengaktifkannya! Terkadang ini dinonaktifkan. Untuk memeriksanya, pada Windows 8 atau lebih tinggi ada dapat membuka **Task Manager** (tekan CTRL + SHIFT + ESC) dan beralih ke tab **Performance**.

source: Image of checking virtualization in Windows 8 or higher
cs: Obrázek kontroly virtualizace v systému Windows 8 nebo vyšším

source: *Virtualization should be enabled*
cs: *Virtualizace by měla být povolena*
id: *Virtualisasi harus diaktifkan*

source: On Windows 7 to see if you have virtualization enabled you can use the `Microsoft® Hardware-Assisted Virtualization Detection Tool <http:// www.microsoft.com/en-us/download/details.aspx?id=592>`_ instead.
cs: V systému Windows 7 můžete pro zjištění, zda máte povolenou virtualizaci, použít místo toho nástroj `Microsoft® Hardware-Assisted Virtualization Detection Tool <http:// www.microsoft.com/en-us/download/details.aspx?id=592>`_.
id: Di Windows 7 untuk mengetahui apakah anda telah mengaktifkan virtualisasi, anda dapat menggunakan `Alat Deteksi Virtualisasi Berbantuan Perangkat Keras Microsoft® <http:// www.microsoft.com/en-us/download/details.aspx?id=592>`_ sebagai gantinya.

source: If virtualization is disabled, you’ll need to enable it. The procedure unfortunately is a bit different for each computer model, so the best way to do this is to look up on a search engine “how to enable vtx for <type your computer model here>”. Often times it’s a matter of restarting the computer, immediately pressing F2 or F12 during startup, navigating the boot menu and changing the settings to enable virtualization (often called “VT-X”).
cs: Pokud je virtualizace zakázána, je třeba ji povolit. Postup se bohužel u každého modelu počítače trochu liší, takže nejlépe uděláte, když si ve vyhledávači vyhledáte "jak povolit vtx pro <type your computer model here>". Často se jedná o restartování počítače, okamžité stisknutí klávesy F2 nebo F12 během spouštění, procházení spouštěcí nabídky a změnu nastavení pro povolení virtualizace (často nazývané "VT-X").

source: Table of different bios keys
cs: Tabulka různých klíčů biosu

source: *Common keys to press at computer startup to access the boot menu for various PC vendors*
cs: *Obvyklé klávesy, které je třeba stisknout při spuštění počítače pro přístup ke spouštěcí nabídce různých výrobců počítačů*
id: *Tombol umum yang harus ditekan saat komputer dihidupkan untuk mengakses menu boot untuk berbagai vendor PC*

source: Step 2. Install Requirements
cs: Krok 2. Požadavky na instalaci
id: Langkah 2. Instal Persyaratan

source: First, you’ll need to install:
cs: Nejprve je třeba nainstalovat:
id: Pertama kali, kamu harus menginstal:

source: Python (latest version 3): https://www.python.org/downloads/windows/
cs: Python (nejnovější verze 3): https://www.python.org/downloads/windows/
id: Python (versi terakhir 3): https://www.python.org/downloads/windows/

source: For Python 3, make sure you check **Add Python 3.x to PATH** during the installation.
cs: V případě Pythonu 3 se ujistěte, že jste během instalace zaškrtli políčko **Přidat Python 3.x do PATH**.
id: Untuk Python 3, pastikan Anda mencentang **Menambahkan Python 3.x ke PATH** selama instalasi.

source: Screenshot of Python3 installation process
cs: Snímek obrazovky procesu instalace Pythonu3

source: *Don’t forget to add the Python executable to your PATH (so that you can run commands with it)*
cs: *Nezapomeňte přidat spustitelný soubor Pythonu do cesty PATH (abyste s ním mohli spouštět příkazy)*.
id: *Jangan lupa untuk menambahkan Python yang dapat dieksekusi ke PATH anda (sehingga anda dapat menjalankan perintah dengannya)*

source: Then, only if you are on Windows 10 Home, Windows 8 (any version) or Windows 7 (any version), install:
cs: Pouze pokud používáte systém Windows 10 Home, Windows 8 (jakoukoli verzi) nebo Windows 7 (jakoukoli verzi), nainstalujte jej:
id: Kemudian, hanya jika anda menggunakan Windows 10 Home, Windows 8 (versi apa pun) atau Windows 7 (versi apa pun), instal:

source: If you are on Windows 10 Professional or a newer version, you should install instead:
cs: Pokud používáte systém Windows 10 Professional nebo novější verzi, měli byste místo toho nainstalovat:
id: Jika anda menggunakan Windows 10 Professional atau versi yang lebih baru, anda harus menginstalnya:

source: Docker for Windows: https://download.docker.com/win/stable/Docker%20for%20Windows%20Installer.exe
cs: Docker pro Windows: https://download.docker.com/win/stable/Docker%20for%20Windows%20Installer.exe
id: Docker untuk Windows: https://download.docker.com/win/stable/Docker%20for%20Windows%20Installer.exe

source: Please do **NOT** install both docker programs. They are different and will create a mess if they are both installed.
cs: Prosím, **NE** instalujte oba programy docker. Jsou odlišné a pokud budou nainstalovány oba, vznikne nepořádek.
id: Harap **JANGAN** menginstal kedua program docker. Keduanya berbeda dan akan membuat kekacauan jika keduanya dipasang.

source: After installing docker, launch it from the Desktop icon that is created from the installation (**Docker Quickstart** in the case of Docker Toolbox, **Docker for Windows** for Docker for Windows). This is important, do not skip this step. If there are errors, follow the prompts on screen to fix them.
cs: Po instalaci nástroje Docker jej spusťte z ikony na ploše, která byla vytvořena při instalaci (**Docker Quickstart** v případě Docker Toolbox, **Docker for Windows** pro Docker for Windows). Je to důležité, tento krok nevynechávejte. Pokud se objeví chyby, postupujte podle pokynů na obrazovce a opravte je.

source: Step 3. Check Memory and CPU Allocation
cs: Krok 3. Zkontrolujte přidělení paměti a procesoru
id: Langkah 3. Periksa Alokasi Memori dan CPU

source: Docker on Windows works by running a VM in the background (think of a VM as a “computer emulator”). This VM has a certain amount of memory allocated and WebODM can only use as much memory as it’s allocated.
cs: Docker v systému Windows funguje tak, že na pozadí běží virtuální počítač (virtuální počítač si představte jako "emulátor počítače"). Tento virtuální počítač má přiděleno určité množství paměti a WebODM může využívat pouze tolik paměti, kolik mu bylo přiděleno.
id: Docker di Windows bekerja dengan menjalankan VM di latar belakang (anggap VM sebagai "emulator komputer"). VM ini memiliki sejumlah memori yang dialokasikan dan WebODM hanya dapat menggunakan memori sebanyak yang dialokasikan.

source: If you installed Docker Toolbox (see below if you installed Docker for Windows instead):
cs: Pokud jste nainstalovali Docker Toolbox (pokud jste místo toho nainstalovali Docker pro Windows, viz níže):

source: Open the **VirtualBox Manager** application
cs: Otevřete aplikaci **VirtualBox Manager**.
id: Buka aplikasi **VirtualBox Manager**

source: Right click the **default** VM and press **Close (ACPI Shutdown)** to stop the machine
cs: Klikněte pravým tlačítkem myši na **defaultní** virtuální počítač a stiskněte **Close (ACPI Shutdown)** pro zastavení počítače.

source: Right click the **default** VM and press **Settings...**
cs: Klikněte pravým tlačítkem myši na **výchozí** virtuální počítač a stiskněte **Nastavení...**

source: Move the **Base Memory** slider from the **System** panel and allocate 60-70% of all available memory, optionally adding 50% of the available processors from the **Processor** tab also
cs: Přesuňte posuvník **Základní paměť** z panelu **Systém** a přidělte 60-70 % veškeré dostupné paměti, případně přidejte také 50 % dostupných procesorů z karty **Procesor**.
id: Pindahkan penggeser **Memori Dasar** dari panel **Sistem** dan alokasikan 60-70% dari semua memori yang tersedia, secara opsional menambahkan 50% prosesor yang tersedia dari tab **Prosesor** juga

source: Screenshot of VirtualBox Settings
cs: Snímek obrazovky nastavení VirtualBoxu

source: *VirtualBox default VM settings*
cs: *Výchozí nastavení virtuálního počítače VirtualBox*

source: Then press **OK**, right click the **default** VM and press **Start**.
cs: Poté stiskněte tlačítko **OK**, klikněte pravým tlačítkem myši na **výchozí** virtuální počítač a stiskněte tlačítko **Spustit**.

source: If you installed Docker for Windows instead:
cs: Pokud jste místo toho nainstalovali Docker pro Windows:
id: Jika anda menginstal Docker untuk Windows sebagai gantinya:

source: Look in the system tray and right click the “white whale” icon.
cs: Podívejte se do systémové lišty a klikněte pravým tlačítkem myši na ikonu "bílé velryby".
id: Lihat di baki sistem dan klik kanan ikon "paus putih".

source: From the menu, press **Settings...**
cs: V nabídce stiskněte **Nastavení...**.
id: Dari menu, tekan **Pengaturan...**

source: From the panel, click **Advanced** and use the sliders to allocate 60-70% of available memory and use half of all available CPUs.
cs: Na panelu klikněte na tlačítko **Pokročilé** a pomocí posuvníků přidělte 60-70 % dostupné paměti a využijte polovinu všech dostupných procesorů.

source: Press **Apply**.
cs: Stiskněte **Použít**.
id: Tekan **Terapkan**.

source: Screenshot of Docker Icon
cs: Snímek obrazovky ikony Dockeru

source: *Step 1 Docker icon*
cs: *Krok 1 Ikona Docker*
id: *Langkah 1 Ikon Docker*

source: Screenshot of Docker Settings
cs: Snímek obrazovky nastavení aplikace Docker

source: *Step 3 & 4 Docker settings*
cs: *Krok 3 a 4 nastavení Dockeru*
id: *Langkah 3 & 4 Pengaturan Docker*

source: Step 4. Download WebODM
cs: Krok 4. Stáhněte si WebODM
id: Langkah 4. Unduh WebODM

source: Open the **Git Gui** program that comes installed with Git. From there:
cs: Otevřete program **Git Gui**, který je nainstalován se systémem Git. Odtud:
id: Buka program **Git Gui** yang sudah diinstal dengan Git. Dari sana:

source: When Git Gui opens, click 'Clone Existing Repository' option
cs: Po otevření nástroje Git Gui klikněte na možnost "Klonovat existující úložiště".
id: Saat Git Gui terbuka, klik opsi 'Gandakan Repositori yang Ada'

source: In **Source Location** type: https://github.com/OpenDroneMap/WebODM
cs: Do pole **Zdrojové umístění** zadejte: https://github.com/OpenDroneMap/WebODM
id: Di **Lokasi Sumber** ketik: https://github.com/OpenDroneMap/WebODM

source: In **Target Directory** click browse and navigate to a folder of your choosing (create one if necessary)
cs: V okně **Cílový adresář** klikněte na tlačítko procházet a přejděte do vybrané složky (v případě potřeby ji vytvořte).

source: Press **Clone**
cs: Stiskněte tlačítko **Klonovat**
id: Tekan **Gandakan**

source: Screenshot of Git Gui
cs: Snímek obrazovky Git Gui

source: If the download succeeded, you should now see this window:
cs: Pokud se stahování podařilo, mělo by se zobrazit toto okno:
id: Jika unduhan berhasil, anda sekarang akan melihat jendela ini:

source: Screenshot of Git Gui after successful download
cs: Snímek obrazovky Git Gui po úspěšném stažení

source: *Git Gui after successful download (clone)*
cs: *Git Gui po úspěšném stažení (klonování)*
id: *Git Gui setelah berhasil mengunduh (Gandakan)*

source: Go to the **Repository** menu, then click **Create Desktop Icon**. This will allow you to come back to this application easily in the future.
cs: Přejděte do nabídky **Úložiště** a klikněte na tlačítko **Vytvořit ikonu na ploše**. To vám umožní se v budoucnu k této aplikaci snadno vracet.

source: Step 4. Launch WebODM
cs: Krok 4. Spusťte WebODM
id: Langkah 4. Luncurkan WebODM

source: From Git Gui, go to the **Repository** menu, then click **Git Bash**. From the command line terminal type:
cs: V prostředí Git Gui přejděte do nabídky **Úložiště** a klikněte na položku **Git Bash**. V terminálu příkazového řádku zadejte:

source: Several components will download to your machine at this point, including WebODM, NodeODM and ODM. After the download you should be greeted by the following screen:
cs: V tomto okamžiku se do počítače stáhne několik komponent, včetně WebODM, NodeODM a ODM. Po stažení by vás měla přivítat následující obrazovka:
id: Beberapa komponen akan diunduh ke mesin anda pada saat ini, termasuk WebODM, NodeODM, dan ODM. Setelah mengunduh, anda akan disambut oleh layar berikut:

source: Screenshot of after successfully downloading WebODM
cs: Snímek obrazovky po úspěšném stažení WebODM

source: *Console output after starting WebODM for the first time*
cs: *Výstup konzoly po prvním spuštění WebODM*
id: *Keluaran konsol setelah memulai WebODM untuk pertama kalinya*

source: If you are using Docker for Windows, open a web browser to http://localhost:8000
cs: Pokud používáte Docker pro Windows, otevřete webový prohlížeč na adrese http://localhost:8000.
id: Jika anda menggunakan Docker untuk Windows, buka browser web ke http://localhost:8000

source: If you are using Docker Toolbox, find the IP address to connect to by typing:
cs: Pokud používáte Docker Toolbox, vyhledejte IP adresu, ke které se chcete připojit, zadáním:

source: You should get a result like the following:
cs: Měli byste získat následující výsledek:
id: Anda harus mendapatkan hasil seperti berikut:

source: Then connect to http://192.168.1.100:8000 (replacing the IP address with the proper one).
cs: Poté se připojte k webu http://192.168.1.100:8000 (IP adresu nahraďte správnou).
id: Kemudian sambungkan ke http://192.168.1.100:8000 (mengganti alamat IP dengan yang benar).

source: Most modern (post 2010) Mac computers running macOS Sierra 10.12 or higher can run OpenDroneMap using docker, as long as hardware virtualization is supported (see below).
cs: Na většině moderních počítačů Mac (po roce 2010) se systémem macOS Sierra 10.12 nebo vyšším lze OpenDroneMap spustit pomocí dockeru, pokud je podporována hardwarová virtualizace (viz níže).

source: Open a Terminal window and type:
cs: Otevřete okno Terminálu a napište:

source: You will get a response similar to the following:
cs: Dostanete podobnou odpověď, jako je tato:
id: Anda akan mendapatkan tanggapan yang mirip dengan berikut ini:

source: If the result is *kern.hv_support: 1*, then your Mac is supported! Continue with Step 2.
cs: Pokud je výsledkem *kern.hv_support: 1*, pak je váš Mac podporován! Pokračujte krokem 2.
id: Jika hasilnya *kern.hv_support: 1*, maka Mac Anda didukung! Lanjutkan dengan Langkah 2.

source: If the result is *kern.hv_support: 0*, unfortunately it means your Mac is too old to run OpenDroneMap. :(
cs: Pokud je výsledkem *kern.hv_support: 0*, To bohužel znamená, že váš Mac je příliš starý na spuštění OpenDroneMap :(.
id: Jika hasilnya *kern.hv_support: 0*, sayangnya itu berarti Mac Anda terlalu tua untuk menjalankan OpenDroneMap. :(

source: There are only two programs to install:
cs: Je třeba nainstalovat pouze dva programy:
id: Hanya ada dua program untuk diinstal:

source: After installing docker you should find an icon that looks like a whale in the task bar.
cs: Po instalaci dockeru byste měli na hlavním panelu najít ikonu, která vypadá jako velryba.
id: Setelah menginstal Docker anda akan menemukan ikon yang terlihat seperti ikan paus di bilah tugas.

source: Screenshot of Docker whale
cs: Snímek obrazovky Docker whale

source: *Docker app running*
cs: *Spuštěná aplikace Docker*
id: *Aplikasi Docker berjalan*

source: You can verify that docker is running properly by opening the **Terminal** app and typing:
cs: Správné spuštění dockeru můžete ověřit tak, že otevřete aplikaci **Terminál** a zadáte:

source: Which should return
cs: Který by měl vrátit
id: Yang harus dikembalikan

source: To verify that git is installed, simply type:
cs: Chcete-li ověřit, zda je git nainstalován, jednoduše zadejte:
id: Untuk memverifikasi bahwa git telah diinstal, cukup ketik:

source: Which should return something similar to the following:
cs: Který by měl vrátit něco podobného:
id: Yang seharusnya mengembalikan sesuatu yang mirip dengan berikut ini:

source: If you get a “bash: git: command not found”, try to restart your **Terminal** app and double-check for any errors during the install process.
cs: Pokud se zobrazí hlášení "bash: git: command not found", zkuste restartovat aplikaci **Terminal** a překontrolujte, zda během instalace nedošlo k chybě.

source: Docker on macOS works by running a VM in the background (think of it as a “computer emulator”). This VM has a certain amount of memory allocated and WebODM can only use as much memory as it’s allocated.
cs: Docker v systému macOS funguje tak, že na pozadí běží virtuální počítač (představte si ho jako "emulátor počítače"). Tento virtuální počítač má přiděleno určité množství paměti a WebODM může využívat pouze tolik paměti, kolik mu bylo přiděleno.

source: Right click the whale icon from the task bar and click **Preferences**...
cs: Klikněte pravým tlačítkem myši na ikonu velryby na hlavním panelu a klikněte na položku **Předvolby**...

source: Select the **Advanced** tab
cs: Vyberte kartu **Pokročilé**

source: Adjust the CPUs slider to use half of all available CPUs and the memory to use 60-70% of all available memory
cs: Nastavte posuvník CPU tak, aby využíval polovinu všech dostupných CPU, a paměť tak, aby využívala 60-70 % veškeré dostupné paměti.

source: Press **Apply & Restart**
cs: Stiskněte tlačítko **Použít a restartovat**
id: Tekan **Terapkan & Mulai Ulang**

source: Screenshot of Docker advanced settings
cs: Snímek obrazovky pokročilého nastavení Docker

source: *Docker advanced settings*
cs: *Pokročilé nastavení Dockeru*
id: *Pengaturan lanjutan Docker*

source: Step 4. Download and Launch WebODM
cs: Krok 4. Stažení a spuštění WebODM
id: Langkah 4. Unduh dan Jalankan WebODM

source: From a **Terminal** type:
cs: V **Terminálu** napište:

source: Then open a web browser to http://localhost:8000.
cs: Poté otevřete webový prohlížeč na adrese http://localhost:8000.
id: Kemudian buka browser web ke http://localhost:8000.

source: OpenDroneMap can run on any Linux distribution that supports docker. According to `docker’s documentation website <https://docs.docker.com/install/>`_ the officially supported distributions are CentOS, Debian, Ubuntu and Fedora, with static binaries available for others. If you have to pick a distribution solely for running OpenDroneMap, Ubuntu is the recommended way to go.
cs: OpenDroneMap lze spustit na libovolné distribuci Linuxu, která podporuje docker. Podle webových stránek s dokumentací `dockeru <https://docs.docker.com/install/>`_ jsou oficiálně podporovanými distribucemi CentOS, Debian, Ubuntu a Fedora, pro ostatní jsou k dispozici statické binární soubory. Pokud si musíte vybrat distribuci výhradně pro spuštění OpenDroneMap, doporučuje se Ubuntu.

source: Step 1. Install Requirements
cs: Krok 1. Instalace požadavků
id: Langkah 1. Instal Persyaratan

source: There are four programs that need to be installed:
cs: Je třeba nainstalovat čtyři programy:
id: Ada empat program yang perlu diinstal:

source: Python (2 or 3)
cs: Python (2 nebo 3)
id: Python (2 atau 3)
