Repository: Chudson16/docs
Catalog: source/locale/*/LC_MESSAGES/installation.po
Languages: cs, id

source: We cannot possibly cover the installation process for every Linux distribution out there, so we’ll limit the instructions to those that are distributions officially supported by docker. In all cases it’s just a matter of opening a terminal prompt and typing a few commands.
cs: Nemůžeme popsat instalační proces pro všechny distribuce Linuxu, takže se omezíme na ty, které jsou oficiálně podporovány dockerem. Ve všech případech jde jen o otevření terminálového příkazu a zadání několika příkazů.
id: Kami tidak mungkin mencakup proses instalasi untuk setiap distribusi Linux di luar sana, jadi kami akan membatasi instruksi hanya untuk distribusi yang secara resmi didukung oleh docker. Dalam semua kasus, ini hanya masalah membuka prompt terminal dan mengetik beberapa perintah.

source: Install on Ubuntu / Debian
cs: Instalace na Ubuntu / Debian
id: Instal di Ubuntu / Debian

source: Commands to type:
cs: Příkazy k zadání:
id: Perintah untuk mengetik:

source: Install on CentOS / RHEL
cs: Instalace na CentOS / RHEL
id: Instal di CentOS / RHEL

source: Install on Fedora
cs: Instalace v systému Fedora
id: Instal di Fedora

source: Install on Arch
cs: Instalace na Arch
id: Instal di Arch

source: Step 2. Check Additional Requirements
cs: Krok 2. Zkontrolujte další požadavky
id: Langkah 2. Periksa Persyaratan Tambahan

source: In addition to the three programs above, the dockercompose script is also needed. Sometimes it’s already installed with docker, but sometimes it isn’t. To verify if it’s installed try to type:
cs: Kromě tří výše uvedených programů je zapotřebí také skript dockercompose. Někdy je již nainstalován spolu s dockerem, ale někdy ne. Chcete-li ověřit, zda je nainstalován, zkuste zadat následující příkaz:
id: Selain ketiga program di atas, menulis skrip docker juga diperlukan. Terkadang sudah terpasang dengan docker, tapi terkadang tidak. Untuk memverifikasi apakah sudah terpasang coba ketik:

source: You should see somethings similar to the following:
cs: Měli byste vidět něco podobného:
id: Anda akan melihat sesuatu yang mirip dengan berikut ini:

source: If instead you get something similar to the following:
cs: Pokud se místo toho zobrazí něco podobného:
id: Jika sebaliknya anda mendapatkan sesuatu yang mirip dengan berikut ini:

source: you can install it by using pip:
cs: můžete nainstalovat pomocí pip:
id: Anda dapat menginstalnya dengan menggunakan pip:

source: Step 3. Download and Launch WebODM
cs: Krok 3. Stažení a spuštění WebODM
id: Langkah 3. Unduh dan Jalankan WebODM

source: From a terminal type:
cs: Z terminálu typu:
id: Dari tipe terminal:

source: Basic Commands and Troubleshooting
cs: Základní příkazy a řešení potíží
id: Perintah Dasar dan Pemecahan Masalah

source: The cool thing about using docker is that 99% of the tasks you’ll ever need to perform while using WebODM can be done via the ./webodm.sh script. You have already encountered one of them:
cs: Skvělé na používání dockeru je, že 99 % úloh, které kdy budete potřebovat provést při používání WebODM, lze provést pomocí skriptu ./webodm.sh. S jednou z nich jste se již setkali:
id: Hal yang keren tentang penggunaan docker adalah 99% tugas yang anda perlukan saat menggunakan WebODM dapat dilakukan melalui skrip ./webodm.sh. Anda telah menjumpai salah satunya:

source: which takes care of starting WebODM and setting up a default processing node (node-odm-1). If you want to stop WebODM, you can already guess what the command is:
cs: který se postará o spuštění WebODM a nastavení výchozího uzlu pro zpracování (node-odm-1). Pokud chcete službu WebODM zastavit, můžete již tušit, jaký je její příkaz:

source: There are several other commands you can use, along with different flags. Flags are parameters passed to the ./webodm.sh command and are typically prefixed with “–”. The **port** flag for example instructs WebODM to use a different network port:
cs: Existuje několik dalších příkazů, které můžete použít spolu s různými příznaky. Příznaky jsou parametry předávané příkazu ./webodm.sh a obvykle mají předponu "-". Například příznak **port** dává WebODM pokyn k použití jiného síťového portu:

source: Other useful commands are listed below:
cs: Další užitečné příkazy jsou uvedeny níže:
id: Perintah berguna lainnya tercantum di bawah ini:

source: `The community forum <https://community.opendronemap.org>`_ is a great place to ask for help if you get stuck during any of the installation steps and for general questions on using the ./webodm.sh script.
cs: `Komunitní fórum <https://community.opendronemap.org>`_ je skvělým místem, kde můžete požádat o pomoc, pokud se zaseknete při některém z kroků instalace, a pro obecné otázky týkající se používání skriptu ./webodm.sh.
id: `Forum komunitas <https://community.opendronemap.org>`_ adalah tempat yang tepat untuk meminta bantuan jika anda mengalami kebuntuan selama salah satu langkah penginstalan dan untuk pertanyaan umum tentang penggunaan skrip ./webodm.sh.

source: Hello, WebODM!
cs: Dobrý den, WebODM!
id: Halo, WebODM!

source: After running ./webodm.sh start and opening WebODM in the browser, you will be greeted with a welcome message and will be asked to create the first user. Take some time to familiarize yourself with the web interface and explore its various menus.
cs: Po spuštění souboru ./webodm.sh start a otevření WebODM v prohlížeči se zobrazí uvítací zpráva a budete vyzváni k vytvoření prvního uživatele. Věnujte nějaký čas seznámení s webovým rozhraním a prozkoumejte jeho různé nabídky.
id: Setelah menjalankan ./webodm.sh mulai dan membuka WebODM di browser, anda akan disambut dengan pesan selamat datang dan akan diminta untuk membuat pengguna pertama. Luangkan waktu untuk membiasakan diri dengan antarmuka web dan menjelajahi berbagai menunya.

source: Screenshot of WebODM Dashboard
cs: Snímek obrazovky ovládacího panelu WebODM

source: Notice that under the **Processing Nodes** menu there’s a "node-odm-1" node already configured for you to use. This is a NodeODM node and has been created automatically by WebODM. This node is running on the same machine as WebODM.
cs: Všimněte si, že v nabídce **Processing Nodes** je již nakonfigurován uzel "node-odm-1", který můžete použít. Jedná se o uzel NodeODM a byl vytvořen automaticky pomocí WebODM. Tento uzel běží na stejném počítači jako WebODM.

source: If you’ve made it this far, congratulations! Now it’s time to start processing some data.
cs: Pokud jste se dostali až sem, gratulujeme vám! Nyní je čas začít zpracovávat data.
id: Selamat jika anda sudah sampai sejauh ini! Sekarang saatnya mulai memproses beberapa data.

source: Image of celebratory dance
cs: Obrázek oslavného tance

source: Running on more than one machine
cs: Spuštění na více než jednom počítači
id: Berjalan di lebih dari satu mesin

source: **Optionally:** If you have another computer, you can repeat the installation process (install docker, git, python, etc.) and launch a new NodeODM node by typing from a Terminal/Git Bash window:
cs: **Případně:** Pokud máte jiný počítač, můžete proces instalace zopakovat (nainstalovat docker, git, python atd.) a spustit nový uzel NodeODM zadáním v okně Terminal/Git Bash:
id: **Opsional:** Jika anda memiliki komputer lain, anda dapat mengulangi proses instalasi (menginstal docker, git, python, dll.) dan meluncurkan node NodeODM baru dengan mengetik dari jendela Terminal / Git Bash:

source: The above command asks docker to launch a new container using the opendronemap/nodeodm image from Docker Hub (the latest version of NodeODM), using port 3000, setting a maximum number of concurrent tasks to 1 and to protect the node from unauthorized access using the password "secret".
cs: Výše uvedený příkaz požádá docker o spuštění nového kontejneru pomocí obrazu opendronemap/nodeodm z Docker Hub (nejnovější verze NodeODM), použití portu 3000, nastavení maximálního počtu souběžných úloh na 1 a ochranu uzlu před neoprávněným přístupem pomocí hesla "secret".

source: From WebODM you can then press the **Add New** button under **Processing Nodes**. For the **hostname/IP** field type the IP of the second computer. For the **port** field type “3000”. For the **token** field type “secret”. You can also add an optional **label** for your node, such as “second computer”. Then press **Save**.
cs: Ve WebODM pak můžete stisknout tlačítko **Přidat nový** v části **Zpracovatelské uzly**. Do pole **název hostitele/IP** zadejte IP adresu druhého počítače. Do pole **port** zadejte "3000". Do pole **token** zadejte "secret". Můžete také přidat nepovinný **název** uzlu, například "druhý počítač". Poté stiskněte tlačítko **Uložit**.

source: If everything went well, you should now have two processing nodes! You will be able to process multiple tasks in parallel using two different machines.
cs: Pokud vše proběhlo v pořádku, měli byste nyní mít dva zpracovatelské uzly! Budete moci paralelně zpracovávat více úloh na dvou různých strojích.
id: Jika semuanya berjalan dengan baik, anda sekarang harus memiliki dua node pemrosesan! Anda akan dapat memproses banyak tugas secara paralel menggunakan dua mesin berbeda.

source: `Learn to edit <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ and help improve `this page <https://github.com/OpenDroneMap/docs/blob/publish/source/installation.rst>`_!
cs: `Naučte se upravovat <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ a pomozte zlepšit `tuto stránku <https://github.com/OpenDroneMap/docs/blob/publish/source/installation.rst>`_!
id: `Belajar mengedit <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ dan membantu meningkatkan `halaman ini <https://github.com/OpenDroneMap/docs/blob/publish/source/installation.rst>`_!

source: Until recently OpenDroneMap was the term used to refer to a single command line application (what is now known as the ODM project). With the recent development of a web interface, an API and other tools, OpenDroneMap has become an ecosystem of various applications to process, analyze and display aerial data. This ecosystem is made of several components:
id: Sampai saat ini OpenDroneMap adalah istilah yang digunakan untuk merujuk ke aplikasi baris perintah tunggal (yang sekarang dikenal sebagai proyek ODM). Dengan perkembangan terkini dari antarmuka web, API, dan alat lainnya, OpenDroneMap telah menjadi ekosistem berbagai aplikasi untuk memproses, menganalisis, dan menampilkan data udara. Ekosistem ini terdiri dari beberapa komponen:

source: **ODM** is the processing engine, which can be used from the command line. It takes images as input and produces a variety of outputs, including point clouds, 3D models and orthophotos
id: **ODM** adalah mesin pemroses, yang dapat digunakan dari baris perintah. Ini mengambil gambar sebagai input dan menghasilkan berbagai output, termasuk point cloud, model 3D, dan orthophotos

source: **NodeODM** is a light-weight API built on top of ODM. It allows users and applications to access the functions of ODM over a computer network
id: **NodeODM** adalah API ringan yang dibangun di atas ODM. Ini memungkinkan pengguna dan aplikasi untuk mengakses fungsi ODM melalui jaringan komputer

source: **WebODM** is a friendly user interface that includes a map viewer, a 3D viewer, user logins, a plugin system and many other features that are expected of modern drone mapping platforms
id: **WebODM** adalah antarmuka pengguna yang ramah yang mencakup penampil peta, penampil 3D, login pengguna, sistem plugin, dan banyak fitur lain yang diharapkan dari platform pemetaan drone modern

source: **CloudODM** is a small command line client to communicate with ODM via the NodeODM API
id: **CloudODM** adalah klien baris perintah kecil untuk berkomunikasi dengan ODM melalui NodeODM API

source: **PyODM** is a Python SDK for creating tasks via the NodeODM API. We cover it in more detail in the “Automated Processing With Python” chapter
id: **PyODM** adalah Python SDK untuk membuat tugas melalui NodeODM API. Kami membahasnya lebih detail di bab "Pemrosesan Otomatis Dengan Python"

source: ODM, NodeODM and WebODM are available on all major platforms (Windows, macOS and Linux) via a program called docker, which is required to run the software. Docker offers a way to run “containers”. Containers are packaged copies of an entire system, its software and its dependencies. These containers run within a virtual environment. On Linux this virtual environment is available from the operating system and is very efficient. On macOS and Windows the containers run within a VM, so there’s a bit of a overhead. but it’s still very suitable for running the software. Once installed users do not have to worry much about docker, as it operates (almost) transparently.
id: ODM, NodeODM dan WebODM tersedia di semua platform utama (Windows, macOS, dan Linux) melalui program yang disebut docker, yang diperlukan untuk menjalankan perangkat lunak. Docker menawarkan cara untuk menjalankan "kontainer". Kontainer adalah salinan paket dari seluruh sistem, perangkat lunaknya, dan dependensinya. Kontainer ini berjalan dalam lingkungan virtual. Di Linux, lingkungan virtual ini tersedia dari sistem operasi dan sangat efisien. Di macOS dan Windows, penampung berjalan dalam VM, jadi ada sedikit tambahan. tetapi masih sangat cocok untuk menjalankan perangkat lunak. Setelah terinstal, pengguna tidak perlu terlalu khawatir tentang docker, karena ia beroperasi (hampir) secara transparan.

source: Without docker it would not be possible to run ODM on Windows or macOS. On these platforms ODM cannot run natively. Future development efforts are being focused on leveraging the new Windows Subsystem for Linux (WSL) and the possibility to make a native port of all dependencies to macOS, which is going to make the installation much easier.
id: Tanpa docker tidak mungkin menjalankan ODM di Windows atau macOS. Pada platform ini, ODM tidak dapat berjalan secara aslinya. Upaya pengembangan di masa mendatang sedang difokuskan pada pemanfaatan Subsistem Windows baru untuk Linux (WSL) dan kemungkinan untuk membuat port asli dari semua dependensi ke macOS, yang akan membuat penginstalan jauh lebih mudah.

source: 4 GB RAM
id: RAM 4 GB

source: 16 GB RAM
id: RAM 16 GB

source: Docker Toolbox: https://github.com/docker/toolbox/releases/download/v18.09.3/DockerToolbox-18.09.3.exe
id: Kotak Alat Docker: https://github.com/docker/toolbox/releases/download/v18.09.3/DockerToolbox-18.09.3.exe

source: *WebODM Dashboard*
id: *Dasbor WebODM*
