Repository: Chudson16/docs
Catalog: source/locale/*/LC_MESSAGES/outputs.po
Languages: ar, es, fr, sw

source: OpenDroneMap Outputs
ar: مخرجات OpenDroneMap
es: Salidas de OpenDroneMap
fr: Sorties OpenDroneMap
sw: OpenDroneMap Matokeo

source: Listed below are some of the useful outputs ODM produces.
ar: فيما يلي بعض المخرجات المفيدة التي تنتجها ODM.
es: A continuación se enumeran algunos de los resultados útiles que produce ODM.
fr: Vous trouverez ci-dessous quelques-uns des résultats utiles produits par ODM.
sw: Vilivyo orodheshwa chini ni matumizi ya matokeo ya ODM

source: Point Cloud
ar: سحابة نقطة
es: Nube de puntos
fr: Nuage de points
sw: Point Coud

source: ``odm_georeferencing/odm_georeferenced_model.ply/laz/csv`` -- The georeferenced point cloud in different file formats
ar: odm_georeferencing/odm_georeferenced_model.ply/laz/csv`` -- سحابة مرجعية جغرافية في تنسيقات ملفات مختلفة
es: ``odm_georeferencing/odm_georeferenced_model.ply/laz/csv`` -- La nube de puntos georeferenciada en diferentes formatos de archivo
fr: ``odm_georeferencing/odm_georeferenced_model.ply/laz/csv`` -- Le nuage de points géoréférencé dans différents formats de fichiers
sw: ``odm_georeferencing/odm_georeferenced_model.ply/laz/csv`` -- Ni georeferenced point cloud katika format tofauti

source: *Point cloud over State University Zanzibar, courtesy of* `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_
ar: * سحابة نقطة State University Zanzibar, من باب المجاملة* `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_
es: *Nube de puntos sobre la Universidad Estatal Zanzibar, cortesía de* `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_
fr: *Nuage de points au-dessus de l'Université d'État de Zanzibar, avec l'aimable autorisation de* `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_
sw: *Picha za anga katika State University Zanzibar, zilizoandaliwa na* `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_

source: 3D Textured Model
ar: نموذج محكم ثلاثي الأبعاد
es: Modelo texturizado 3D
fr: Modèle texturé 3D

source: ``odm_texturing/odm_textured_model.obj`` -- The textured surface mesh ``odm_texturing/odm_textured_model_geo.obj`` -- The georeferenced and textured surface mesh
ar: ``odm_texturing/odm_textured_model.obj`` -- شبكة سطح محكم ``odm_texturing/odm_textured_model_geo.obj`` -- شبكة السطح ذات المرجعية الجغرافية والمحكم
es: ``odm_texturing/odm_textured_model.obj`` -- La malla de superficie texturizada ``odm_texturing/odm_textured_model_geo.obj`` -- La malla de superficie texturizada y georeferenciada
fr: ``odm_texturing/odm_textured_model.obj`` -- Le maillage de surface texturé ``odm_texturing/odm_textured_model_geo.obj`` -- Le maillage de surface géoréférencé et texturé

source: You can access the point cloud and textured meshes using MeshLab. Open MeshLab, and choose File:Import Mesh and choose your textured mesh from a location similar to the following: ``odm_texturing\odm_textured_model.obj``
ar: يمكنك الوصول إلى سحابة النقاط والشبكات المزخرفة باستخدام MeshLab. افتح MeshLab واختر File: Import Mesh واختر شبكتك المزخرفة من موقع مشابه لما يلي: ``odm_texturing\odm_textured_model.obj``
es: Puede acceder a la nube de puntos y las mallas texturizadas usando MeshLab. Abra MeshLab, y vaya a File:Import Mesh y seleccione su malla texturizada de una ubicación similar a la siguiente: ``odm_texturing\odm_textured_model.obj``
fr: Vous pouvez accéder au nuage de points et aux maillages texturés à l'aide de MeshLab. Ouvrez MeshLab et choisissez Fichier:Importer Maillage et choisissez votre maillage texturé à partir d'un emplacement similaire au suivant : ``odm_texturing\odm_textured_model.obj``
sw: Unaweza kupata pointcloud na textured mesh kutumia MeshLab. Fungua MeshLab,na chagua file :Ingiza Mesh na chagua textured mesh yako kutoka eneo sawa na lifuatalo: ``odm_texturing\odm_textured_model.obj``

source: *Textured mesh courtesy of* `OpenDroneMap <https://twitter.com/opendronemap>`_
ar: * مجاملة شبكة محكم * `OpenDroneMap <https://twitter.com/opendronemap>`_
es: *Malla texturizada cortesia de* `OpenDroneMap <https://twitter.com/opendronemap>`_
fr: *Maillage texturé avec l'aimable autorisation de* `OpenDroneMap <https://twitter.com/opendronemap>`_

source: Orthophoto
es: Ortofoto

source: ``odm_orthophoto/odm_orthphoto.png`` -- The orthophoto, but this is a simple png, which doesn't have any georeferencing information
ar: ``odm_orthophoto/odm_orthphoto.png`` -- orthophoto ، ولكن هذا هو png بسيط ، والذي لا يحتوي على أي معلومات عن المراجع الجغرافية
es: ``odm_orthophoto/odm_orthphoto.png`` -- La ortofoto, pero este es un simple png, que no tiene información de georreferenciación
sw: sgid "``odm_orthophoto/odm_orthphoto.png`` -- The orthophoto, lakini hii ni simple png, ambayo ambayo haina maelezo ya georeferencing

source: ``odm_orthophoto/odm_orthphoto.tif`` -- GeoTIFF Orthophoto. You can use it in QGIS as a raster layer.
ar: ``odm_orthophoto/odm_orthphoto.tif`` -- GeoTIFF Orthophoto. يمكنك استخدامه في QGIS كطبقة نقطية.
es: ``odm_orthophoto/odm_orthophoto.tif`` -- Ortofoto GeoTIFF. Puede usarla en QGIS como una capa raster.
fr: ``odm_orthophoto/odm_orthphoto.tif`` -- Orthophoto GeoTIFF. Vous pouvez l'utiliser dans QGIS en tant que couche raster.
sw: ``odm_orthophoto/odm_orthphoto.tif`` -- GeoTIFF Orthophoto. Unaweza kuitumia kwenye QGIS kama tabaka la rasta.

source: *Orthophoto over State University Zanzibar, courtesy of* `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_
ar: Orthophoto على جامعة ولاية زنجبار ، بإذن من * `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_
es: *Ortofoto sobre la Universidad Estatal de Zanzibar, cortesía de* `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_
fr: *Orthophoto de l'Université d'État de Zanzibar, avec l'aimable autorisation de* `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_
sw: Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_

source: DTM/DSM will only be created if the ``--dtm`` or ``--dsm`` options are used. See `tutorial on elevation models <https://docs.opendronemap.org/tutorials.html#creating-digital-elevation-models>`_ for more options in creating.
ar: DTM/DSM سيتم إنشاؤه فقط في حالة استخدام خيارات "--dtm" أو "--dsm". انظر `البرنامج التعليمي حول نماذج الارتفاع <https://docs.opendronemap.org/tutorials.html#creating-digital-elevation-models>`_ لمزيد من الخيارات في الإنشاء.
es: Los DTM/DSM solo se crearán si se usan las opciones ``--dtm`` o ``--dsm``. Vea el `tutorial de modelos de elevación <https://docs.opendronemap.org/tutorials.html#creating-digital-elevation-models>`_ para mas opciones sobre su creación.
fr: Le DTM/DSM ne sera créé que si les options ``--dtm`` ou ``--dsm`` sont utilisées. Voir `tutoriel sur les modèles d'élévation <https://docs.opendronemap.org/tutorials.html#creating-digital-elevation-models>`_ pour plus d'options de création.
sw: DTM/DSM itatengenezwa ikiwa ``--dtm`` au ``--dsm`` zitatumika. Angali `tutorial on elevation models <https://docs.opendronemap.org/tutorials.html#creating-digital-elevation-models>`_ kwa njia zaidi za kutengeneza.

source: Data will be stored in:
ar: سيتم تخزين البيانات في:
es: Los datos se almacenarán en:
fr: Les données seront stockées dans:
sw: Data zitahifadhiwa ndani ya:

source: *Digital surface model over State University Zanzibar, courtesy of* `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_
ar: * نموذج سطح رقمي فوق جامعة ولاية زنجبار ، بإذن من * `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_
es: *Modelo digital de superficie sobre la Universidad Estatal de Zanzibar, cortesía de* `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_
fr: *Modèle de surface numérique sur l'Université d'État de Zanzibar, avec l'aimable autorisation de* `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_

source: List of all outputs
ar: قائمة بجميع المخرجات
es: Lista de todas las salidas
fr: Liste de toutes les sorties
sw: Mpangilo wa matokeo yote

source: `Learn to edit <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ and help improve `this page <https://github.com/OpenDroneMap/docs/blob/publish/source/outputs.rst>`_!
es: `Aprende a editar <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ y ayuda a mejorar `esta página <https://github.com/OpenDroneMap/docs/blob/publish/source/outputs.rst>`_!
fr: `Apprenez à éditer <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ et aidez à améliorer `cette page <https://github.com/OpenDroneMap/docs/blob/publish/source/outputs.rst>`_!

source: `Help edit these docs! <https://github.com/OpenDroneMap/docs/blob/publish/source/outputs.rst>`_
ar: `ساعد في تحرير هذه المستندات! <https://github.com/OpenDroneMap/docs/blob/publish/source/outputs.rst>`_
sw: `kwa msaada kurekebisha kitabu! <https://github.com/OpenDroneMap/docs/blob/publish/source/contributing.rst>`_

source: ``odm_orthophoto/odm_orthphoto.original.tif`` -- The orthophoto in its original un-cropped state.
fr: ``odm_orthophoto/odm_orthphoto.original.tif`` -- L'orthophoto dans son état d'origine non rogné.
