Repository: Chudson16/docs
Catalog: source/locale/*/LC_MESSAGES/requesting-features.po
Languages: cs, es, fr, sw

source: How To Request Features
cs: Jak požádat o funkce
es: Cómo solicitar funciones
fr: Comment demander des fonctionnalités
sw: Vipi Utaomba Vipengel

source: All software needs user feedback and feature requests, to grow and maintain alignment with the needs of its users.
cs: Každý software potřebuje zpětnou vazbu od uživatelů a požadavky na funkce, aby se mohl vyvíjet a udržovat v souladu s potřebami svých uživatelů.
es: Todo el software necesita comentarios de los usuarios y solicitudes de funciones para crecer y mantener la alineación con las necesidades de sus usuarios.
fr: Tous les logiciels ont besoin des commentaires des utilisateurs et des demandes de fonctionnalités, pour se développer et maintenir l'alignement avec les besoins de ses utilisateurs.
sw: Programu zote zinahitaji mrejosho kutoka kwa watumiaji na vipengele vya kuomba, kwa kukuza na kuimarisha mahitaji ya mtumiaji.

source: OpenDroneMap is FOSS software. Free and open source (FOSS) projects are interesting from the inside and outside: from the outside, successful ones feel like they should be able to do anything, and it’s hard to know what a reasonable request is. From the inside of a project, they can feel very resource constrained: largely by time, money, and opportunity overload.
cs: OpenDroneMap je software FOSS. Projekty se svobodným a otevřeným zdrojovým kódem (FOSS) jsou zajímavé zevnitř i zvenčí: zvenčí mají úspěšné projekty pocit, že by měly umět cokoli, a je těžké poznat, co je rozumný požadavek. Zevnitř projektu se mohou cítit velmi omezené ve zdrojích: z velké části časem, penězi a přetížením příležitostmi.
es: OpenDroneMap es un software FOSS. Los proyectos gratuitos y de código abierto (FOSS) son interesantes por dentro y por fuera: desde fuera, los que tienen éxito sienten que deberían poder hacer cualquier cosa y es difícil saber qué es una solicitud razonable. Desde el interior de un proyecto, pueden sentirse muy limitados en recursos: principalmente por tiempo, dinero y sobrecarga de oportunidades.
fr: OpenDroneMap est un logiciel FOSS. Les projets libres et open source (FOSS) sont intéressants de l'intérieur et de l'extérieur : de l'extérieur, ceux qui réussissent ont l'impression qu'ils devraient pouvoir tout faire, et il est difficile de savoir ce qu'est une demande raisonnable. De l'intérieur d'un projet, ils peuvent se sentir très limités en ressources : en grande partie par le temps, l'argent et la surcharge d'opportunités.
sw: OpenDroneMap ni FOSS programu. Free and open source (FOSS) mradi wa kupendeza kutoka ndani na nje: kutoka nje, mafanikio zaidi hisi kama wanaweza kufanya kila kitu, na ni ngumu kujua ni yapi maombi ya msingi. Kutoka ndani ya mradi wanaweza kuhisi jambo zito: muda mkubwa, pesa na fursa nyingi.

source: A feature request can be submitted as issues on the applicable Github repository (e.g., `WebODM <https://github.com/OpenDroneMap/WebODM/issues>`_ or `ODM <https://github.com/OpenDroneMap/ODM/issues>`_ or similar) or more simply as a discussion topic on `the community forum <https://community.opendronemap.org/>`_. Try to start by searching these sources to see if someone else has already brought it up. Sometimes a feature is already in the works, or has at least been discussed.
cs: Požadavek na funkci lze zadat jako problém v příslušném úložišti Github (např. `WebODM <https://github.com/OpenDroneMap/WebODM/issues>`_ nebo `ODM <https://github.com/OpenDroneMap/ODM/issues>`_ nebo podobně) nebo jednodušeji jako diskusní téma na `komunitním fóru <https://community.opendronemap.org/>`_. Zkuste pro začátek prohledat tyto zdroje, zda na to již někdo jiný neupozornil. Někdy se na funkci již pracuje nebo se o ní alespoň diskutovalo.
es: Se puede enviar una solicitud de función como problemas en el repositorio de Github correspondiente (por ejemplo, `WebODM <https://github.com/OpenDroneMap/WebODM/issues>`_ or `ODM <https://github.com/OpenDroneMap/ODM/issues>`_ o similar) o más simplemente como un tema de discusión en `el foro de la comunidad <https://community.opendronemap.org/>`_. Intente comenzar buscando en estas fuentes para ver si alguien más ya lo mencionó. A veces, una característica ya está en proceso, o al menos se ha discutido.
fr: Une demande de fonctionnalité peut être soumise en tant que problèmes sur le référentiel Github applicable (par exemple, `WebODM <https://github.com/OpenDroneMap/WebODM/issues>`_ ou `ODM <https://github.com/OpenDroneMap/ODM/issues>`_ ou similaire) ou plus simplement comme sujet de discussion sur `le forum de la communauté <https://community.opendronemap.org/>`_. Essayez de commencer par rechercher ces sources pour voir si quelqu'un d'autre l'a déjà évoqué. Parfois, une fonctionnalité est déjà en préparation, ou a au moins été discutée.
sw: Maombi ya vipengele yanaweza kuwasilishwa kama jambo katika maombi ya anuani Github (e.g `WebODM <https://github.com/OpenDroneMap/WebODM/issues>`_ au `ODM <https://github.com/OpenDroneMap/ODM/issues>`_ au sawa) au rahisi zaidi kama mada ya kujadiliwa ndani ya `jukwaa la kijamii <https://community.opendronemap.org/>`_. Jaribu kuwanza kwa kutafuta asili kuangalia ikiwa itafanya kazi, au angalau imejadiliwa.

source: To request the addition of support for new drone cameras: please share a set of test images on the `datasets channel on the forum <https://community.opendronemap.org/c/datasets/10>`_. Without test images there's not much the developers can do.
cs: Chcete-li požádat o přidání podpory pro nové kamery pro drony: sdílejte prosím sadu testovacích snímků na kanálu `data na fóru <https://community.opendronemap.org/c/datasets/10>`_. Bez testovacích snímků toho vývojáři moc nezmůžou.
es: Para solicitar la adición de soporte para nuevas cámaras de drones: por favor comparta un conjunto de imágenes en el canal de `Conjuntos de datos en el foro <https://community.opendronemap.org/c/datasets/10>` _. Sin imágenes de prueba, no hay mucho que los desarrolladores puedan hacer.

source: And importantly, the trick is to listen: if someone within the project says: "This is a big lift, we need MONEY or TIME or SOMEONE TO HELP CODE IT" (or possibly a combination of the three) then there are two answers that work really well in response:
cs: A co je důležité, trik spočívá v naslouchání: pokud někdo v rámci projektu řekne: "Tohle je velký výtah, potřebujeme PENÍZE nebo ČAS nebo NĚKOHO, kdo by nám to pomohl nakódovat" (nebo případně kombinaci těchto tří možností), pak existují dvě odpovědi, které fungují opravdu dobře:
es: Y lo que es más importante, el truco es escuchar: si alguien dentro del proyecto dice: "Esto es un gran impulso, necesitamos DINERO o TIEMPO o ALGUIEN QUE AYUDE A CODIFICARLO" (o posiblemente una combinación de las tres), entonces hay dos respuestas que funciona muy bien en respuesta:
fr: Et surtout, l'astuce est d'écouter : si quelqu'un au sein du projet dit : "C'est un gros coup de pouce, nous avons besoin d'ARGENT ou de TEMPS ou DE QUELQU'UN POUR AIDER À LE CODER" (ou éventuellement une combinaison des trois), alors il y a deux réponses fonctionne très bien en réponse:
sw: Muhimu zaidi, njia ni kusikia: kiwa mtu ndani ya mradi kasema: "Huu ni msaada mkubwa, tunahitaji PESA au MUDA au MTU KUSAIDIA CODE" (au uwezekano wa hizo tatu) kisha kuna majibu mawiliyanayofanya kazi vizuri zaidi kujibu:

source: *Ok. I didn’t know it was a big feature request! I hope someone comes along with the necessary resources. As a community member, I would be happy to be an early user and tester!*
cs: *Ok. Nevěděl jsem, že je to velký požadavek na funkci! Doufám, že někdo přijde s potřebnými prostředky. Jako člen komunity se rád stanu prvním uživatelem a testerem!*
es: *Ok. ¡No sabía que era una gran solicitud de funciones! Espero que venga alguien con los recursos necesarios. Como miembro de la comunidad, ¡estaría feliz de ser uno de los primeros usuarios y tester!*
fr: *D'accord. Je ne savais pas que c'était une grosse demande de fonctionnalité ! J'espère que quelqu'un viendra avec les ressources nécessaires. En tant que membre de la communauté, je serais heureux d'être un des premiers utilisateurs et testeurs !*
sw: *Sawa. Sijuiyalikua maombi ya vipengele vikubwa! Natamani mtu atakuja na vitendea kazi muhimu.Miongoni mwa wanajamii, Nitafurahi kuwa mtumiaji wa mwanzo kujaribu!*

source: or
cs: nebo
es: o
fr: ou
sw: a

source: *Let’s figure out if we can put together the resources to get this done! Here’s what I can contribute toward it: …*
cs: *Přijdeme na to, jestli můžeme dát dohromady prostředky, abychom to mohli udělat! Tady je, čím mohu přispět: ...*
es: *¡Averigüemos si podemos reunir los recursos para lograrlo! Esto es lo que puedo contribuir para lograrlo: ...*
fr: * Voyons si nous pouvons rassembler les ressources pour y parvenir ! Voici ce que je peux y contribuer : …*
sw: *Wacha tuone ikiwa tutaunganisha pamoja rasilimali kulimaliza hili! ivyo naweza kushiriki kwa: ...*

source: We are glad you are excited to see new features added to the project. Some new features need support, and some are easier to implement. We'll do our best to help you understand where your request falls, and we appreciate any support you can provide.
cs: Jsme rádi, že se těšíte na nové funkce přidané do projektu. Některé nové funkce potřebují podporu a některé je jednodušší implementovat. Uděláme vše pro to, abychom vám pomohli pochopit, kam váš požadavek spadá, a oceníme jakoukoli podporu, kterou nám můžete poskytnout.
es: Nos alegra que esté emocionado de ver nuevas funciones agregadas al proyecto. Algunas funciones nuevas necesitan soporte y otras son más fáciles de implementar. Haremos todo lo posible para ayudarlo a comprender dónde se encuentra su solicitud y agradecemos cualquier apoyo que pueda brindar.
fr: Nous sommes heureux que vous soyez ravi de voir de nouvelles fonctionnalités ajoutées au projet. Certaines nouvelles fonctionnalités nécessitent une prise en charge et d'autres sont plus faciles à mettre en œuvre. Nous ferons de notre mieux pour vous aider à comprendre où se situe votre demande, et nous apprécions tout soutien que vous pouvez fournir.
sw: Tunafurahi unahamu kuona vitu vipya vinaongezwa katika mradi. Baadhi ya vitu vipya vinahitaji msaada, na baadhi ni rahisi kuvitengeneza. Tutafanya tuwezalo kukusaidia wewe kufahamu wapi maombi yako hayakufanikiwa, na tunathamini msaada wowote utakaoweza kutupa.

source: `Learn to edit <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ and help improve `this page <https://github.com/OpenDroneMap/docs/blob/publish/source/requesting-features.rst>`_!
cs: `Naučte se upravovat <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ a pomozte zlepšit `tuto stránku <https://github.com/OpenDroneMap/docs/blob/publish/source/requesting-features.rst>`_!
es: `Aprende a editar <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ y ayuda a mejorar `esta página <https://github.com/OpenDroneMap/docs/blob/publish/source/requesting-features.rst>`_!
fr: `Apprenez à éditer <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ et aidez à améliorer `cette page <https://github.com/OpenDroneMap/docs/blob/publish/source/requesting-features.rst>`_!

source: `Help edit these docs! <https://github.com/OpenDroneMap/docs/blob/publish/source/requesting-features.rst>`_
sw: `kwa msaada kurekebisha kitabu! <https://github.com/OpenDroneMap/docs/blob/publish/source/requesting-features.rst>`_
