Repository: Chudson16/docs
Catalog: source/locale/*/LC_MESSAGES/resources.po
Languages: ar, fr

source: Additional References
ar: مراجع إضافية
fr: Références Additionnelles

source: For Users
ar: للمستخدمين
fr: Pour Utilisateurs

source: The following resources are a good place to start:
ar: الموارد التالية هي مكان جيد للبدء:
fr: Les ressources suivantes sont un bon point de départ :

source: `README page for ODM <https://github.com/OpenDroneMap/OpenDroneMap>`_
ar: `اقرأ الصفحة عن ODM <https://github.com/OpenDroneMap/OpenDroneMap>`_
fr: `Pages LISEZMOI pour ODM <https://github.com/OpenDroneMap/OpenDroneMap>`_

source: `README page for WebODM <https://github.com/OpenDroneMap/WebODM>`_
ar: `قراءة صفحة WebODM <https://github.com/OpenDroneMap/WebODM>`_
fr: `Pages LISEZMOI pour WebODM <https://github.com/OpenDroneMap/WebODM>`_

source: `README page for NodeODM <https://github.com/OpenDroneMap/node-OpenDroneMap>`_
ar: `قراءة صفحة NodeODM <https://github.com/OpenDroneMap/node-OpenDroneMap>`_
fr: `Pages LISEZMOI pour NodeODM <https://github.com/OpenDroneMap/node-OpenDroneMap>`_

source: `Ground Control Points Format Specification <https://github.com/mapillary/OpenSfM/blob/master/doc/source/gcp.rst>`_
ar: `مواصفات تنسيق نقاط التحكم الأرضية <https://github.com/mapillary/OpenSfM/blob/master/doc/source/gcp.rst>`_
fr: `Spécification du format des points de contrôle au sol <https://github.com/mapillary/OpenSfM/blob/master/doc/source/gcp.rst>`_

source: `OpenDroneMap: The Missing Guide <https://odmbook.com/>`_
ar: `OpenDroneMap: الدليل المفقود <https://odmbook.com/>`_
fr: `OpenDroneMap : Le guide manquant <https://odmbook.com/>`_

source: For Developers
ar: للمطورين
fr: Pour les Développeurs

source: In addition to user resources, we recommend to also read the following:
ar: بالإضافة إلى موارد المستخدم ، نوصي أيضًا بقراءة ما يلي:
fr: En plus des ressources utilisateur, nous vous recommandons de lire également ce qui suit :

source: WebODM documentation: https://docs.webodm.org
ar: وثائق WebODM: https://docs.webodm.org

source: NodeODM API specification: https://github.com/OpenDroneMap/NodeODM/blob/master/docs/index.adoc
ar: مواصفات NodeODM API: https://github.com/OpenDroneMap/NodeODM/blob/master/docs/index.adoc
fr: Spécifications de l'API NodeODM: https://github.com/OpenDroneMap/NodeODM/blob/master/docs/index.adoc

source: Overview of the ODM pipeline: http://community.opendronemap.org/t/where-can-i-find-background-information-on-the-concepts-of-odm/665/2
ar: نظرة عامة على خط أنابيب ODM: http://community.opendronemap.org/t/where-can-i-find-background-information-on-the-concepts-of-odm/665/2
fr: Présentation du pipeline ODM : http://community.opendronemap.org/t/where-can-i-find-background-information-on-the-concepts-of-odm/665/2

source: We keep a `section in our forum dedicated to research papers <http://community.opendronemap.org/c/ideas-proposals/research-papers>`_. This is a valuable place where to read more about state of the art research related to structure from motion, multi-view stereo, meshing, texturing, etc. which can be used to improve the software.
ar: نحتفظ `بقسم في منتدانا مخصص للأوراق البحثية <http://community.opendronemap.org/c/ideas-proposals/research-papers>`_. ذا مكان قيم لقراءة المزيد عن أحدث الأبحاث المتعلقة بالهيكل من الحركة ، ستيريو متعدد الرؤية ، الشبكات ، التركيب ، إلخ. والتي يمكن استخدامها لتحسين البرنامج.
fr: Nous gardons une `section dans notre forum dédiée aux articles de recherche <http://community.opendronemap.org/c/ideas-proposals/research-papers>`_. C'est un endroit précieux où en savoir plus sur la recherche de pointe liée à la structure à partir du mouvement, de la stéréo multi-vues, du maillage, de la texturation, etc., qui peut être utilisé pour améliorer le logiciel.

source: `Help edit these docs! <https://github.com/OpenDroneMap/docs/blob/publish/source/api.rst>`_
ar: `ساعد في تحرير هذه المستندات! <https://github.com/OpenDroneMap/docs/blob/publish/source/api.rst>`_

source: `Learn to edit <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ and help improve `this page <https://github.com/OpenDroneMap/docs/blob/publish/source/resources.rst>`_!
fr: `Apprenez à éditer <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ et aidez à améliorer `cette page <https://github.com/OpenDroneMap/docs/blob/publish/source/resources.rst>`_!
