Repository: Chudson16/docs
Catalog: source/locale/*/LC_MESSAGES/arguments/auto-boundary.po
Languages: cs

source: auto-boundary
cs: automatické ohraničení

source: Automatically set a boundary using camera shot locations to limit the area of the reconstruction. This can help remove far away background artifacts (sky, background landscapes, etc.). See also --boundary. Default: ``False``
cs: Automatické nastavení hranice pomocí míst záběrů kamery pro omezení oblasti rekonstrukce. To může pomoci odstranit vzdálené artefakty pozadí (obloha, krajina v pozadí atd.). Viz také příkaz --boundary. Výchozí hodnota: ``False``

source: Parameter Type:
cs: Typ parametru:

source: Parameter Domain:
cs: Doména parametru:

source: Parameter Default:
cs: Parametr Výchozí:

source: Resource
cs: Zdroje

source: Impact
cs: Dopad

source: ●○○ | Low
cs: ●○○ | Nízký

source: ○○○ | None
cs: ○○○ | Žádný

source: Time
cs: Čas

source: What Is Auto-Boundary?
cs: Co je automatická hranice?

source: ``--auto-boundary`` is a process that seeks to limit the boundaries of the reconstruction based upon a K-Means filtered Convex Hull buffered by 20x the mean GSD of the dataset.
cs: ``--auto-boundary`` je proces, který se snaží omezit hranice rekonstrukce na základě K-Means filtrovaného konvexního trupu s bufferem 20x střední GSD datové sady.

source: When Is Auto-Boundary Helpful?
cs: Kdy je automatická hranice užitečná?

source: ``--auto-boundary`` is appropriate to use on any dataset where one might possibly consider limiting the area of reconstruction due to the presence of sky or far-away background that they would not normally consider part of the desired reconstruction.
cs: ``--auto-boundary`` je vhodné použít pro jakoukoli datovou sadu, kde by bylo možné uvažovat o omezení oblasti rekonstrukce z důvodu přítomnosti oblohy nebo vzdáleného pozadí, které by normálně nebylo považováno za součást požadované rekonstrukce.

source: In other words, if you would consider masking the image, ``--auto-boundary`` is likely a good choice.
cs: Jinými slovy, pokud uvažujete o maskování obrázku, ``--auto-boundary`` je pravděpodobně dobrou volbou.

source: Why would one use auto-boundary?
cs: Proč by měl někdo používat automatické ohraničení?

source: Auto-Boundary is most helpful in preventing the reconstruction area from growing needlessly large when things like sky, clouds, or far-away features like treelines get included in the reconstruction.
cs: Funkce automatického ohraničení je nejužitečnější při prevenci zbytečného zvětšování oblasti rekonstrukce, když se do rekonstrukce zahrnou věci jako obloha, mraky nebo vzdálené prvky, například stromořadí.

source: By preventing the boundaries of the reconstruction from growing needlessly large, Out-Of-Memory errors become far less likely, and one will likely see a decrease in processing time due to the smaller area being reconstructed.
cs: Tím, že se zabrání zbytečnému zvětšování hranic rekonstrukce, se sníží pravděpodobnost chyb Out-Of-Memory a pravděpodobně dojde ke zkrácení doby zpracování díky menší rekonstruované oblasti.

source: Example Images
cs: Příklady snímků

source: WebODM displaying the reconstruction extent of a terrestrial orbit survey of a Northern Catalpa tree.
cs: WebODM zobrazující rozsah rekonstrukce pozemního orbitálního průzkumu stromu katalpy severní.

source: The WebODM 3D View shows the full extent of the reconstruction, bounded by the ``--auto-boundary`` option.
cs: Zobrazení WebODM 3D zobrazuje celý rozsah rekonstrukce ohraničený volbou ``--auto-boundary``.

source: The WebODM 3D View shows the full extent of the recosntruction. Compared to the ``--auto-boundary`` reconstruction above, one can see that the full reconstruction area is much larger (and therefore more visually sparse).
cs: 3D zobrazení WebODM zobrazuje celý rozsah rekonstrukce. V porovnání s výše uvedenou rekonstrukcí ``--auto-boundary`` je vidět, že celá oblast rekonstrukce je mnohem větší (a tedy vizuálně řidší).

source: `Learn to edit <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ and help improve `this page <https://github.com/OpenDroneMap/docs/blob/publish/source/arguments_edit/auto-boundary.rst>`_!
cs: `Naučte se upravovat <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ a pomozte zlepšit `tuto stránku <https://github.com/OpenDroneMap/docs/blob/publish/source/arguments_edit/auto-boundary.rst>`_!
